tap "buo/cask-upgrade"
tap "cormacrelf/tap"
tap "dimentium/autoraise"
tap "finestructure/hummingbird"
tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/test-bot"
tap "jesseduffield/lazydocker"
tap "jesseduffield/lazygit"
tap "joelekstrom/repo"
tap "jorgerojas26/lazysql"
tap "jstkdng/programs"
tap "laishulu/homebrew"
tap "morantron/tmux-fingers"
tap "nikitabobko/tap"
tap "owo-network/brew"
tap "yt-dlp/taps"
# TIFF library and utilities
brew "libtiff"
# High dynamic-range image file format
brew "openexr"
# C string library for manipulating Unicode strings
brew "libunistring"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# Download with resuming and segmented downloading
brew "aria2"
# GNU File, Shell, and Text utilities
brew "coreutils"
# YAML Parser
brew "libyaml"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Connect and disconnect Bluetooth devices
brew "bluetoothconnector"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Software library to render fonts
brew "freetype"
# Core application library for C
brew "glib"
# X.Org: Interface to the X Window System protocol
brew "libxcb"
# X.Org: Core X11 protocol client library
brew "libx11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Human-friendly and fast alternative to cut and (sometimes) awk
brew "choose-rust"
# Tool for emulating mouse and keyboard events
brew "cliclick"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# Asynchronous event library
brew "libevent"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Power of curl, ease of use of httpie
brew "curlie"
# Command-line tool for getting & setting the default browser
brew "defaultbrowser"
# Secure communications between a client and a DNS resolver
brew "dnscrypt-proxy"
# Command-line DNS Client for Humans
brew "doggo"
# More intuitive version of du in rust
brew "dust"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Low-level cryptographic library
brew "nettle"
# Validating, recursive, caching DNS resolver
brew "unbound"
# Multi-format archive and compression library
brew "libarchive"
# Fastest and safest AV1 video encoder
brew "rav1e"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Extensions to follow Vincent Driessen's branching model
brew "git-flow"
# Git extension for versioning large files
brew "git-lfs"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# GNU grep, egrep and fgrep
brew "grep"
# Powerful, lightweight programming language
brew "lua"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Configurable static site generator
brew "hugo"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Image manipulation library
brew "jpeg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Pager program similar to more
brew "less"
# Configuration file processing library
brew "libconfig"
# Rime Input Method Engine
brew "librime"
# X.Org: X Toolkit Intrinsics library
brew "libxt"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Package manager for the Lua programming language
brew "luarocks"
# Mac App Store command-line interface
brew "mas"
# Fast Cross-Platform Package Manager
brew "micromamba"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Control nvim processes using `nvr` command-line tool
brew "neovim-remote"
# Port scanning utility for large networks
brew "nmap"
# Retrieves currently playing media, and simulates media actions
brew "nowplaying-cli"
# Ncurses based sudoku game
brew "nudoku"
# Tools for one-time password authentication systems
brew "oath-toolkit"
# Open source suite of directory software
brew "openldap"
# Painless compression and decompression for your terminal
brew "ouch"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Pandoc filter for numbering and cross-referencing
brew "pandoc-crossref"
# General-purpose scripting language
brew "php"
# Python dependency management tool
brew "pipenv"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Paste PNG into files
brew "pngpaste"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Theme for zsh
brew "powerlevel10k"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Intuitive find & replace CLI
brew "sd"
# SOcket CAT: netcat on steroids
brew "socat"
# Formatting tool for reformatting Swift code
brew "swiftformat"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# Manipulate and query tags on macOS files
brew "tag"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Code-search similar to ack
brew "the_silver_searcher"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash", link: true
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Generator for LS_COLORS with support for multiple color themes
brew "vivid"
# Check your $HOME for unwanted files and directories
brew "xdg-ninja"
# JavaScript package manager
brew "yarn"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Watcher for macOS 10.14+ light/dark mode changes
brew "cormacrelf/tap/dark-notify"
# Focus-follows-mouse for MacOS
brew "dimentium/autoraise/autoraise", args: ["with-dexperimental_focus_first"]
# A simple terminal UI for docker, written in Go
brew "jesseduffield/lazydocker/lazydocker"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
# An ncurses-based minesweeper game
brew "joelekstrom/repo/terminal-mines"
brew "jorgerojas26/lazysql/lazysql"
# MacOS Input Source Manager
brew "laishulu/homebrew/macism"
# mouseless terminal interaction
brew "morantron/tmux-fingers/tmux-fingers"
# DeepLX is a permanently free DeepL API client written in Golang.
brew "owo-network/brew/deeplx"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# GPU-accelerated terminal emulator
cask "alacritty"
# Application launcher and productivity software
cask "alfred"
# Enable Windows-like alt-tab
cask "alt-tab"
# Inspect application bundles
cask "apparency"
# Application uninstaller
cask "appcleaner"
# Chromium based browser
cask "arc"
# Menu bar icon organiser
cask "bartender"
# Utility to create and modify archives
cask "betterzip"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Chinese-German dictionary
cask "dehelper"
# Calendar software
cask "fantastical"
# Collaborative team software
cask "figma"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-lxgw-bright"
cask "font-sf-pro"
# Tool that helps teams design every part of the product experience
cask "framer"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Desktop automation application
cask "hammerspoon"
# Free and open-source media player
cask "iina"
# Multi-touch gestures editor
cask "jitouch"
# Keyboard customiser
cask "karabiner-elements"
# Password manager app
cask "keepassxc"
# File archiver
cask "keka"
# Open-source keystroke visualiser
cask "keycastr"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# Adaptive brightness for external displays
cask "lunar"
# Add more gestures for Trackpad and Magic Mouse
cask "multitouch"
# Screensaver displaying artwork based on Spotify or Last.fm profile data
cask "musaicfm"
# Desktop sync client for Nextcloud software products
cask "nextcloud"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Finds large, unwanted files and deletes them
cask "omnidisksweeper"
# Replacement for Docker Desktop
cask "orbstack"
# Read, annotate, edit, convert, create, OCR, fill forms and sign PDFs
cask "pdf-reader-pro"
# VPN client focusing on security
cask "protonvpn"
# Quick Look plugin for mobile apps and provisioning profiles
cask "provisionql"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# Quick Look plugin for plaintext files without an extension
cask "qlstephen"
# Thumbnails, static previews, cover art and metadata for video files
cask "qlvideo"
# Quick Look plugin for CSV files
cask "quicklook-csv"
# Quick Look plugin for JSON files
cask "quicklook-json"
# Environment for statistical computing and graphics
cask "r"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Rime input method engine
cask "squirrel"
# Quicklook extension for source files
cask "syntax-highlight"
# Utility for producing audio feedback when typing
cask "tickeys"
# Run commands and display their output on the desktop
cask "ubersicht"
# Open-source code editor
cask "visual-studio-code"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Collect, organise, cite, and share research sources
cask "zotero"
mas "AdBlock", id: 1402042596
mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "Bob", id: 1630034110
mas "Dark Reader for Safari", id: 1438243180
mas "Encrypto", id: 935235287
mas "Keynote 讲演", id: 409183694
mas "Keyword Search", id: 1558453954
mas "Numbers 表格", id: 409203825
mas "Pages 文稿", id: 409201541
mas "Pixelmator Pro", id: 1289583905
mas "Remote Mouse", id: 403195710
mas "Spark", id: 1176895641
mas "Tampermonkey Classic", id: 1482490089
mas "Tencent Lemon Lite", id: 1449962996
mas "uBlacklist for Safari", id: 1547912640
mas "Vimari", id: 1480933944
mas "WireGuard", id: 1451685025
vscode "animaapp.vscode-anima"
vscode "baurine.vscode-pangu"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "eeyore.yapf"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.copilot-workspace"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "ionutvmi.path-autocomplete"
vscode "kortina.vscode-markdown-notes"
vscode "mdickin.markdown-shortcuts"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-sqlite"
vscode "notzaki.pandocciter"
vscode "qwtel.sqlite-viewer"
vscode "rvest.vs-code-prettier-eslint"
vscode "sswg.swift-lang"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-german"
vscode "tomoki1207.pdf"
vscode "vadimcn.vscode-lldb"
vscode "vincaslt.highlight-matching-tag"
vscode "vscodevim.vim"
vscode "vsls-contrib.gistfs"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
