tap "buo/cask-upgrade"
tap "dimentium/autoraise"
tap "homebrew/test-bot"
tap "jesseduffield/lazydocker"
tap "joelekstrom/repo"
tap "jorgerojas26/lazysql"
tap "laishulu/homebrew"
tap "morantron/tmux-fingers"
tap "nikitabobko/tap"
tap "twio142/tap"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# TIFF library and utilities
brew "libtiff"
# High dynamic-range image file format
brew "openexr"
# C string library for manipulating Unicode strings
brew "libunistring"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# Download with resuming and segmented downloading
brew "aria2"
# Distributed revision control system
brew "git"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Code searching, linting, rewriting
brew "ast-grep"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Connect and disconnect Bluetooth devices
brew "bluetoothconnector"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Core application library for C
brew "glib"
# X.Org: Interface to the X Window System protocol
brew "libxcb"
# X.Org: Core X11 protocol client library
brew "libx11"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Human-friendly and fast alternative to cut and (sometimes) awk
brew "choose-rust"
# Tool for emulating mouse and keyboard events
brew "cliclick"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Asynchronous event library
brew "libevent"
# YAML Parser
brew "libyaml"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Power of curl, ease of use of httpie
brew "curlie"
# Command-line tool for getting & setting the default browser
brew "defaultbrowser"
# Load/unload environment variables based on $PWD
brew "direnv"
# Secure communications between a client and a DNS resolver
brew "dnscrypt-proxy"
# Command-line DNS Client for Humans
brew "doggo"
# More intuitive version of du in rust
brew "dust"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Low-level cryptographic library
brew "nettle"
# Validating, recursive, caching DNS resolver
brew "unbound"
# Multi-format archive and compression library
brew "libarchive"
# Fastest and safest AV1 video encoder
brew "rav1e"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Git extension for versioning large files
brew "git-lfs"
# High-level command-line interface for Git
brew "git-town"
# Audit git repos for secrets
brew "gitleaks"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Ping, but with a graph
brew "gping"
# GNU grep, egrep and fgrep
brew "grep"
# Powerful, lightweight programming language
brew "lua"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Configurable static site generator
brew "hugo"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Jupyter notebooks as Markdown documents, Julia, Python or R scripts
brew "jupytext"
# Fast and secure open-source backup
brew "kopia"
# Simple terminal UI for git commands
brew "lazygit"
# Pager program similar to more
brew "less"
# Rime Input Method Engine
brew "librime"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Package manager for the Lua programming language
brew "luarocks"
# Easily convert Marp Markdown files into static HTML/CSS, PDF, PPT and images
brew "marp-cli"
# Mac App Store command-line interface
brew "mas"
# Control and observe media playback from the command-line
brew "media-control"
# Fast Cross-Platform Package Manager
brew "micromamba"
# Like sed, awk, cut, join & sort for name-indexed data such as CSV
brew "miller"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Control nvim processes using `nvr` command-line tool
brew "neovim-remote"
# Port scanning utility for large networks
brew "nmap"
# Tools for one-time password authentication systems
brew "oath-toolkit"
# Open source suite of directory software
brew "openldap"
# Painless compression and decompression for your terminal
brew "ouch"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Paste PNG into files
brew "pngpaste"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Rsync for cloud storage
brew "rclone"
# SVG rendering tool and library
brew "resvg"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Intuitive find & replace CLI
brew "sd"
# SOcket CAT: netcat on steroids
brew "socat"
# Formatting tool for reformatting Swift code
brew "swiftformat"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# Manipulate and query tags on macOS files
brew "tag"
# Modernized, complete, self-contained TeX/LaTeX engine
brew "tectonic"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Code-search similar to ack
brew "the_silver_searcher"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash", link: true
# Parser generator tool
brew "tree-sitter-cli"
# Simple file transfer tools, similar to lrzsz (rz/sz), and compatible with tmux
brew "trzsz-go"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Generator for LS_COLORS with support for multiple color themes
brew "vivid"
# Command-line XML and HTML beautifier and content extractor
brew "xq"
# JavaScript package manager
brew "yarn"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Zsh plugin manager
brew "zimfw"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Focus-follows-mouse for MacOS
brew "dimentium/autoraise/autoraise", args: ["with-dexperimental_focus_first", "with-dold_activation_method"]
# A simple terminal UI for docker, written in Go
brew "jesseduffield/lazydocker/lazydocker"
# An ncurses-based minesweeper game
brew "joelekstrom/repo/terminal-mines"
brew "jorgerojas26/lazysql/lazysql"
# macOS Input Source Manager
brew "laishulu/homebrew/macism"
# mouseless terminal interaction
brew "morantron/tmux-fingers/tmux-fingers"
# CLI tool for managing battery charging
brew "twio142/tap/battery"
# Watcher for macOS 10.14+ light/dark mode changes
brew "twio142/tap/dark-notify"
# Go library for converting Chinese hanzi to pinyin
brew "twio142/tap/go-pinyin"
# Cross-platform GUI plist editor written in python
brew "twio142/tap/propertree"
# Language server for text input with rime
brew "twio142/tap/rime-ls"
# Command-line tool for sharing terminal over the web
brew "twio142/tap/ttyd", args: ["HEAD"]
# Terminal-based typing test
brew "twio142/tap/ttyper"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Application launcher and productivity software
cask "alfred"
# Enable Windows-like alt-tab
cask "alt-tab"
# Inspect application bundles
cask "apparency"
# Application uninstaller
cask "appcleaner"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# Utility to create and modify archives
cask "betterzip"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Tool to show live information about the batteries in various devices
cask "coconutbattery"
# Chinese-German dictionary
cask "dehelper"
# Window peeking utility app
cask "dockdoor"
# Calendar software
cask "fantastical"
# Collaborative team software
cask "figma"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-lxgw-bright"
cask "font-sf-pro"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Desktop automation application
cask "hammerspoon"
# Free and open-source media player
cask "iina"
# Multi-touch gestures editor
cask "jitouch"
# Menu bar manager
cask "jordanbaird-ice"
# Keyboard customiser
cask "karabiner-elements"
# Password manager app
cask "keepassxc"
# File archiver
cask "keka"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# Adaptive brightness for external displays
cask "lunar"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Finds large, unwanted files and deletes them
cask "omnidisksweeper"
# Replacement for Docker Desktop
cask "orbstack"
# Apple Notes extension
cask "pronotes"
# Quick Look plugin for mobile apps and provisioning profiles
cask "provisionql"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# Quick Look plugin for plaintext files without an extension
cask "qlstephen"
# Thumbnails, static previews, cover art and metadata for video files
cask "qlvideo"
# Quick Look plugin for CSV files
cask "quicklook-csv"
# Quick Look plugin for JSON files
cask "quicklook-json"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# PDF reader and note-taking application
cask "skim"
# Rime input method engine
cask "squirrel-app"
# Quicklook extension for source files
cask "syntax-highlight"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Run commands and display their output on the desktop
cask "ubersicht"
# Open-source code editor
cask "visual-studio-code"
# Collect, organise, cite, and share research sources
cask "zotero"
mas "AdBlock", id: 1402042596
mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "Bob", id: 1630034110
mas "Dark Reader for Safari", id: 1438243180
mas "Folder Preview", id: 6698876601
mas "Keynote", id: 409183694
mas "Keyword Search", id: 1558453954
mas "Numbers", id: 409203825
mas "Obsidian Web Clipper", id: 6720708363
mas "Pages", id: 409201541
mas "Pixelmator Pro", id: 1289583905
mas "Remote Mouse", id: 403195710
mas "Spark", id: 1176895641
mas "Tampermonkey Classic", id: 1482490089
mas "Tencent Lemon Lite", id: 1449962996
mas "uBlacklist for Safari", id: 1547912640
mas "Vimari", id: 1480933944
mas "WireGuard", id: 1451685025
vscode "asvetliakov.vscode-neovim"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "figma.figma-vscode-extension"
vscode "formulahendry.code-runner"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "google.gemini-cli-vscode-ide-companion"
vscode "gruntfuggly.todo-tree"
vscode "ionutvmi.path-autocomplete"
vscode "kortina.vscode-markdown-notes"
vscode "mdickin.markdown-shortcuts"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "notzaki.pandocciter"
vscode "streetsidesoftware.code-spell-checker"
vscode "tomoki1207.pdf"
vscode "vscodevim.vim"
